/*
в js 7 примитивных типов данных, и ссылочные типы данных, грубо говоря
объекты. в ts ситуация похожая, из примитивных типов строятся более сложные
типы данных, но так же в ts есть специальные типы данных, их 5, если прибавить
литералы. 

типы в ts делятся на несколько групп:
1. примитивы;
2. составные типы (composite types);
3. специальные типы (any, never);
4. generic types;
5. литералы ("red" | "green");
6. union/intersection;

типы - это множество, и работать с ними нужно, как с множеством.
string - бесконечное множество, number - бесконечное множество.
boolean - множество из двух значение (true/false).

string, number, boolean - примитивные множества, но бывают и сложные
множества, например, объекты или составные типы.

с множествами могут идти различные операции:
1. объединение x|y;
2. пересечение x&y;

в объединении мы перечисляем несколько типов, в данном примере:
let data: number | string;
data = 5;
data = 'str';
можно сказать, что data должен быть либо число, либо строка.
мы объединяем два множества - получается третье множество,
которое может быть либо первым, либо вторым

при объединении сложных множеств у нас может 
возникнуть 3 ситуации:
1. когда содержится в итоговом типе поля объекта x;
2. когда содержится в итоговом типе поля объекта y;
3. пересечение, когда объект содержит и 
поля типа x, и поля типа y.

пересечение подразумевает, что итоговый тип включает в себя
то, что есть в типе x, и то, что есть в типе y.

если объединение мы воспринимаем, как логическое ИЛИ, то
пересечение мы воспринимаем, как логическое И.

в этом примере будет never, ведь пересечения строки и 
числа не существует.
let value: number & string;
тут может быть объединение, но не может быть пересечения.

надтип является основным типом, а подтип его дополнением.
можно провести аналогию с ООП, и сказать, что надтип - это
основной класс, а подтип просто основной класс наследует.

явного наследование тут может и не быть, ts видит, что поля 
совпадают и допускает такой код:
const subType: SubType = { name: "gleb", age: 67 };
const superType: SuperType = subType;
то есть, тип, у которого полей больше, чем в другом типе,
может спокойно присваиваться подобным способом.

так сделать в обратную сторону уже нельзя:
const superType: SuperType = { name: "max" };
const subType: subType = superType;

правила:
1. подтип включает в себя все свойства и/или методы надтипа,
плюсом может добавлять свои;
2. надтип может содержать меньше свойств и/или методов, 
чем подтип;
3. объект подтипа может быть присвоен переменной надтипа.
обратное не всегда возможно без приведения типов.

примитивные типы данных в ts:
1. string;
2. number;
3. bigInt;
4. boolean;
5. undefined;
6. null;
7. symbol.
*/
// объединение (union type):
let data: number | string;
data = 5;
data = 'str';

let color: 'red' | 'green';

// объединение сложных типов:
type MainInfo = {
    firstName: string;
    lastName: string;
}

type additionalInfo = {
    age: number;
}

type FullInfo = additionalInfo | MainInfo;

// пересечение x и y
const info0: FullInfo = { firstName: '123', lastName: '123', age: 123 };

// только поле x
const info1: FullInfo = { firstName: '123', lastName: '123' };

// только поле y
const info2: FullInfo = { age: 123 }

// пересечение (never)
let value: number & string;

// возможное пересечение
type CoolInfo = additionalInfo | MainInfo;

// концепция надтипов и субтипов
type SuperType = {
    name: string;
}

type SubType = {
    name: string;
    age: number;
}

// допустимый код
const subType: SubType = { name: "gleb", age: 67 };
const superType: SuperType = subType;

// указываем примитивные типы данных:
const value_1: number = 5;
const value_2: string = 'str';
const value_3: boolean = false;