/*
литералы - это конкретные значения, которые мы 
используем, как тип. делается это для того, чтобы
сузить значение.

виды литералов:
1. строковые литералы (string);
2. числовые литералы (number);
3. булевы литералы (boolean);
4. шаблонные строковые литералы;
5. составные литералы.

строковые литералы - это те литералы, 
которые состоят из строк.

числовые литералы - это те литералы,
которые состоят из чисел.

булевы литералы - это те литералы,
которые состоят из булевых значений.

если мы хотим, чтобы конкретное поле было 
неизменяемым, используем readonly.

составные литералы - это смесь разных типов
в виде литерала.
*/
// литералы
// строковые литералы
type Color = 'red' | 'green' | 'blue';

// числовые литералы
type Size = 4 | 8 | 16;

// булевы литералы 
type Bool = false | true;

// используем наш литерал
const color: Color = 'green'

// нужно использовать as const, 
// чтобы использовать с нашим литералом
const values = {
    color: 'green'
} as const;

// можно использовать литералы в функции
function paint(color: Color) {

}

// спокойно принимает, так как color - литерал
paint(color)

// с as const у объекта можно сделать так:
paint(values.color)

// readonly
interface User {
    readonly id: string;
}

// шаблонные строковые литералы
type EventName = 'click' | 'change';

// создаем шаблон для handler 
type EventHandler = `on${EventName}`

// пример использования:
type UserId = `user_id_${string}`

// составные литералы
type data = 'gleb' | 67 | false;