/*
js - язык с слабой и динамической типизацией, в больших 
масштабах проекта мы получаем неожиданный ответ, сюда входят:
1. неявная типизация;
2. неявное и явное сравнение;
3. и т.д.
тип определяется во время рантайма и может меняться!

TypeScript - язык с статической типизацией, строго типизированный 
язык программирования! является надстройкой над js, только
с улучшением. 
статическая типизация бывает:
1. явной;
2. выводимой;
3. структурной.

статическая типизация - типы проверяются на этапе 
компиляции, а не выполнения.

явная типизация, мы определяем тип данных: 
let variable: number = 5;

выводимая типизация, ts сам определит тип данных:
let variable = 5;

структурная типизация, есть пример, у нас два объекта,
два разных имени, но одинаковое содержание, с точки зрения
ts эти типы взаимозаменяемые, то есть, если какая-то функция
на вход ожидает тип Person, а вы передадите тип User, то ts
будет все равно, он примет этот тип.
*/
// явная типизация:
let variable: number = 5;

// выводимая типизация:
let newVariable = 5

// структурная типизация
type User = {
    firstName: string;
    LastName: string; 
}

type Person = {
	firstName: string
	LastName: string
}