/*
преобразование типов подразумевает, когда мы один 
тип явно или неявно превращаем в другой.

преобразование типов бывает:
1. явным;
2. неявным.

есть явный и неявный вывод типов, но преобразование
типов - это немного другое.

с неявным преобразованием все просто - прибавили число 
к строке и число стало строкой, конкатенация.

явное преобразование. представим, у нас есть объект,
для ts это просто объект с 2 полями. мы его явно определили
в коде, и проблем нет. Но если мы получили этот же объект
с сервера? ts его уже не прочитает, для него это obj
с какими-то полями, который вывести он не сможет.

для решения подобных проблем есть as. допустим мы распарсили
представленный person, и мы хотим сказать, что obj - person.
этот метод небезопасен и в реальном продакшене его следует
избегать.

мы добавили еще одно обязательное поле, password, но в obj
поле не указано, ошибки от ts не будет, так как мы уже
преобразовали obj в person, он думает, что это поле уже есть.

в этом методе есть множество странных вещей, например, в obj
мы добавили несуществующее поле shit, и если мы после него
все-таки укажем поле password, то ошибки не будет.

можно указать person перед объектом <person> - это не generic,
и он не воспринимается jsx.

ts все-таки не дает сделать глупое явное преобразование типов.
есть метод, чтобы это обойти, но в продакшене так делать нельзя.

есть особый метод satisfies, в отличие от as оно не преобразовывает
объект, оно лишь проверяет соответствие. прежний объект останется
таким же и в person не превратиться, но ts проверит совпадают ли
эти объекты структурно.

понятно, что as в продакшене лучше не использовать, так как это
any в другой обертке

допустимо использовать as:
1. в конфигах;
2. в тестах;
3. при работе с html элементами (иногда);
4. в утилитарных функциях;
5. когда ts не может вывести тип.

просто так преобразовать один тип в другой нельзя!
лучше настроить линтер, чтобы один тип в другой 
не преобразовывать.

есть одна очень важная ловушка, которую допускают много людей.
это ловушка: <T extends Object>, есть здесь один нюанс.
*/
// выводы типов
// явный вывод типов
const a: string = 'string'

// неявный вывод типов
const a2 = 'string'

// неявное преобразование 
let aNum = 10
// конкатенация, на выходе string
let b = aNum + '123' 

// явное преобразование
interface Person {
    age: number
    username: string

    // добавим еще одно поле
    password: string
}

// небезопасный метод as
const obj = {
    age: 25,
    username: 'gleb',
    shit: 123,
    password: 'svg'
} as Person

// метод лучше, но не воспринимается jsx
const obj2 = <Person>{
	age: 25,
	username: 'gleb'
}

// глупые явные преобразования ts сделать не даст:
// const str = '123' as number
// есть метод, чтобы сделать такое преобразование:
const str = '123123' as unknown as number

// satisfies метод
const obj3 = {
    age: 25,
    username: 'gleb',
    password: 'string'
} satisfies Person

// пример, код небезопасный:
// парсим json, получаем any
const parsedJson = JSONParse<Person>('{age:25}')

// можно сделать и так, опять же небезопасно
// const parsedJson: Person = JSON.parse('{age:25}')

// пишем helper с generic и преобразованием
function JSONParse<T>(data: string): T {
    return JSON.parse(data) as T
}

// асинхронная функция 
async function fn() {
    const data = await fetch('')
    const parsedData = await data.json()
}

// пример номер 2:
const PersonKeys = {
    age: 'age',
    username: 'username',
    password: 'password'
} as const 

const keys = Object.keys(obj)

function keys<T extends Object>(data: T): Array<keyof T> {
    return Object.keys(data) as Array<keyof T>
}

const k = keys(obj)