/*
клиент-серверное взаимодействие - это процесс обмена информации
между клиентом и сервером с помощью отправления запросов.
под клиентом мы подразумеваем браузер и тот js-код, который
мы пишем для браузера, а сервер, если сильно упрощать - url адреса.
чтобы получить url адреса переходим на сайт JSONPlaceholder

функция для запроса на сервер - fetch.
запросы не выполняются мгновенно, поэтому fetch возвращает нам promise.
можно выполнить запрос с помощью async await, но мы оставим promise

судя по url мы получаем информацию о списке дел, о одной записи.

смотрим в терминале response:
если запрос выполнился успешно то в свойстве ok будет true.
в status всегда будет какое-то число: код 200 - успешно, 
код 404 - не найдено и так далее. 
коды 200-226 - success, 400-499 - client error, 500-526 - server error.

метод json() - с помощью мы отправляем response дальше, он то же требует
времени, и то же promise.
*/
/*
и так, что получается, у нас есть кнопка, по нажатию которой происходит
запрос к серверу, ответ от сервера обрабатывается в первом promise, логируется,
затем результат передается дальше, во втором promise ответ логируется в консоль, 
затем затем деструктурируются id, title, completed, и наконец в resultElement рисуется
красивая разметка.

добавим возможность пользователю вводить свой идентификатор задач.
мы видим, что при вводе неправильно идентификатора появляется undefined,
а в консоли у объекта status: 404.

попытаемся отловить ошибку и сказать пользователю, что произошла ошибка.
используем метод catch, но ничего не получается. на самом деле так и должно быть
promise выполнился успешно, проблема не в нем, а в том, что ответил нам сервер.
*/
const loadPostFormItem = document.querySelector('.load-post-form')
const postIdInputElement = document.querySelector('#post-id')
const resultElement = document.querySelector('.result')

loadPostFormItem.addEventListener('submit', event => {
	event.preventDefault()

	// сделать запрос на сервер:
	fetch(`http://localhost:3000/posts/${postIdInputElement.value}`)
		.then(response => {
			console.log('response:', response)

			if (!response.ok) {
				const errorMessage =
					response.status === 404
						? 'post on chosen id dont founded'
						: 'something went wrong :('

				throw new Error(errorMessage)
			}

			return response.json()
		})
		.then(json => {
			console.log(json)

			const { title, views } = json

			resultElement.innerHTML = `
                <p>${title}, views: ${views}</p>
            `
		})
		.catch((error) => {
			resultElement.innerHTML = error.message
		})
})

/*
далее следует углубится еще немного в клиент-серверное 
взаимодействие, и ознакомится с тем, какие методы запросов
бывают. настроим локальный сервер. после настройки мы поменяли
код вместо todo у нас post. если мы можем получить информацию,
то можем и отправить информацию. основные методы запросов: GET, POST,
PUT, PATH, DELETE.

в основном при изучении fetch мы работали с GET по умолчанию
GET - получить информацию с сервера
POST - отправить данные на сервер
*/
const createPostFormElement = document.querySelector('.create-post-form')

createPostFormElement.addEventListener('submit', (event) => {
    event.preventDefault()

    const formData = new FormData(createPostFormElement)
    const formDataObject = Object.fromEntries(formData)

    // если мы хотим что-то не GET то нужно указать объект с параметрами запроса
    fetch('http://localhost:3000/posts', {
        method: 'post',
        body: JSON.stringify({
            ...formDataObject,
            views: 0,
        }),
        /*
        это заголовок в запросе [headers], что это?
        это информация, которая может потребоваться серверу,
        чтобы корректно обработать ваш запрос.

        credentials - для чего оно нужно?
        в браузере имеется несколько хранилищ данных,
        session storage, local storage и др. в частности cookie.
        в cookie хранится небольшой набор информации о посетителе
        сайта. содержание cookie фронтендеры не должны контролировать,
        и зачастую информацию cookie принудительно пихает сервер.
        по умолчанию при использовании fetch не отправляются cookie
        пользователя, а иногда серверу это необходимо, если указать этот
        параметр, то cookie отправится вместе с запросом.
        */
        headers: {
            'Content-type': 'application/json; charset=UTF-8'
        },
        credentials: 'include',
    })
        .then((response) => {
            console.log('response:', response)

            return response.json()
        })
        .then((json) => {
            console.log('json:', json)
        })
})

// get request parameters
const searchPostsFormElement = document.querySelector('.search-posts-form')
const postViewsInputElement = document.querySelector('#post-views')

searchPostsFormElement.addEventListener('submit', (event) => {
    event.preventDefault()

    // параметры можно указать прям в url адресе
    fetch(`http://localhost:3000/posts?views_gte=${postViewsInputElement.value}`)
        .then((response) => response.json())
        .then((json) => {
            console.log(json)

            resultElement.innerHTML = json
                .map(({ title, views }) => `<p>${title}, views: ${views}</p>`)
                .join('')
        })
})

/* 
разберемся, как анализировать запросы в devtools браузера.
мы можем использовать вкладку network, когда мы открыли эту
вкладку, здесь в табличке мы увидим все загружаемые браузером 
ресурсы на конкретной странице. перезагружаем страницу, и видим 
список - здесь будут и css, и js, и html, и шрифты - все то, что 
требуется странице для ее работы и отображения контента.

мы нажимаем на fetch/xhr - здесь будут отображаться все запросы fetch.
мы нажмем и заполним все три формы значениями, и нажмем submit.
в табличке network находятся все три записи о трех запросах.
если запрос выполнился успешно, его название загорается белым, если - ошибка,
то загорается красным. 

в status мы видим код-status, в колонке type - тип запроса, в колонке
initiator - названия скрипта, где выполнен fetch-запрос и на какой строке
он находится, в колонке size - размер или вес запроса, в колонке time - время
выполнения запроса. если мы в ячейке Name нажмем на запрос, то откроется
окно с детальным описанием запроса.

тут, в этом подробном окне, есть headers вкладка, а там есть response headers 
(получаем), request headers (отправляем). на фронтенде мы можем контролировать 
только request headers. в request headers помимо стандартных заголовков будут те, 
которые мы указывали вручную сами. 

заглянем в вкладку payload, тут находятся те данные, которые мы отправляем
вместе с запросом, тут есть все то, что мы заполняли ранее. у некоторых
запросов payload вкладки может и не быть. 

еще одна полезная вкладка response - здесь хранятся ответы от сервера
мы увидим данные в виде json, вместе с этой вкладкой есть вкладка preview -
то же самое, но показывает данные в виде объекта в терминале js.

в вкладке initiator можно увидеть детальный стек вызова, который
привел к выполнению запроса.

во вкладке timing выводятся данные о временных показателях запроса.
здесь есть длительность операции отправки запроса, длительность ожидания
ответа от сервера, длительность загрузки контента.

запросы изначально отсортированы сверху-вниз от первого до последнего,
внизу у нас будет самый свежий запрос, который выполнен последним.

так же в таблицу можно добавить полезную вещь - waterfall - по нажатию
правой кнопки мыши. он отображает последовательность выполнения
запроса относительно других, тут для каждого запроса отображается
миниатюрный таймлайн, то есть временная шкала, по шкалам мы видим, что
первый запрос выполнился раньше всех.

вверху над таблицей показана более развернутая информация, чем в waterfall.
слева и справа этого таймлайн есть ползунки, мы можем сузить таймлайн для просмотра
*/