// сбор данных с формы
/*
это нужно, чтобы иметь больше контроль над теми
данными, которые отправляются на сервер, разумеется
классическая html форма будет работать и без js кода, но
в современном фронтенде сценарий взаимодействия с формами
стали куда сложнее, чем были раньше.

атрибут action предназначен для указания адреса и имени
серверного скрипта, который будет выполнятся после отправки
формы, а в атрибуте method указывается метод отправки формы,
обычно это get или post.
*/
const formElement = document.querySelector('form')

formElement.addEventListener('submit', (event) => {
	// отмена стандартной браузерной отправки формы
	event.preventDefault()

	// сбор данных с формы
	/*
    определяемся со структурой данных, 
    в которую кладем информацию. удобнее 
    всего данные формы хранить в объекте.
    */

	// сбор данных с формы через класс formData
    /*
    жмем на кнопку и в консоли появляется объект
    в котором ничего нет, но ведь ничего не заполнено,
    мы заполнили, но теперь в объекте снова ничего нет.
    на самом деле данные в этой сущности есть, просто
    мы их так не увидим, эта структура данных похожа на коллекцию
    map, для работы с этой структурой данных есть специальные методы
    */
    // сбор данных с формы через класс formData 
    const formData = new FormData(formElement)

    // методы для работы со структурой данных
    // добавить собственную пару ключ-значение
    formData.append('example', 'bla-bla-bla')

    // принять имя ключа и возвратить значение
    console.log('value for key "name:', formData.get('example'))

    // принимает имя ключа и возвращает true или false
    console.log('example:', formData.has('example'))

    // удаляет по имени запись из структуры formData
    formData.delete('example')

    // мы могли бы перебрать список записей 
    formData.forEach((value, name) => {
        console.log(`${name}: ${value}`)
    })

    // для просмотра содержимого formData можно так:
    console.log( Object.fromEntries(formData) )
    // как мы видим, formData работает как надо

	// этот код можно включить для тестирования
	//    const formData = {}

	//    // пройдемся по элементам и добавим инфо в formData
	//    for (const element of formElement.elements) {
	//     /*
	//     мы нажимаем на submit кнопку, не заполняя
	//     поля, на первый взгляд, кажется, что получилось неплохо,
	//     но если взглянуть внимательнее, то можно заметить
	//     ошибку, тут есть странное: "": "" - это из-за fieldset и button,
	//     у которых нет name: value, кажется, что это незначительная проблема,
	//     но лучше ее убрать.
	//     */
	//    if (!element.name) {
	//         continue
	//    }

	//    // обработка значений с input type checkbox
	//    if (element.type === 'checkbox') {
	//         formData[element.name] = element.checked
	//         continue
	//    }

	//    // обработка значений с input type radio
	//    if (element.type === 'radio' && !element.checked) {
	//         continue
	//    }

	//     // выведутся все элементы
	//     console.log('element:', element)

	//     // добавим в тупую в formData информацию
	//     formData[element.name] = element.value
	//    }

	//    // выведем formData в консоль
	console.log('formData:', formData)
})