// cookie в браузере
/*
cookie - это небольшие фрагменты данных склеенные в единую 
строку в единую строку, чтобы прочитать cookie нужно обратиться
к объекту document свойству cookie.

сейчас по консоли видно, что в значении ничего нет, формально, в
значении находится пустая строка.

мы добавляем значение и несмотря на то, что console.log был вызван до
добавления значения к свойству cookie, все равно свойство cookie показало 
свежие значения. это все потому, что хранилища данных не обнуляются после
перезагрузки страницы.

данные в cookie - это небольшие фрагменты, склеенные в одну строку.
эти самые фрагменты состоят из имени, значения и некоторых других
данных.

смотрим cookie и что в них хранится, заходим на npmjs.com и заходим в devtools,
нажимаем на application и смотрим вкладку storage, там находим cookie и открываем,
внутри лежит url и нажимаем на него, мы увидим, что хранится в cookie.

в устанавливаемом значении необходимо указать имя записи и значение записи:
'some-text' - не надо, 'username=gleb' - надо.

используя document.cookie мы не перезаписываем полностью cookie, а лишь точечно
добавляем информацию. если мы добавим еще один age, но с другим значением, то
мы перезапишем значение age, но username останется прежним.

если в cookie есть спецсимволы, в том числе пробелы, то несмотря на то, что в
cookie она появилась, такая конструкция может отработать некорректно.
для правильного добавления такой записи нужен другой метод
*/
// установить значение cookie
console.log('cookie:', document.cookie)

// добавим какие-то данные, используя свойство, как сеттер
document.cookie = 'username=gleb'

// добавим еще данных
document.cookie = 'age=67'
document.cookie = 'age=69'

// правильное добавление записи с спецсимволами
document.cookie = `${encodeURIComponent('date of birth')}=${encodeURIComponent('february 4, 1996')}`

// для более удобного кода сделаем утилитарную функцию
const setCookie = (name, value, options = {}) => {
    let newEntryBody = `${encodeURIComponent(name)})=${encodeURIComponent(value)}`

    const optionAsString = Object.entries(options)
        .map((entry) => entry.join('='))
        .join('; ')

    if (optionAsString) {
        newEntryBody += `; ${optionAsString}`
    }

    document.cookie = newEntryBody
}

setCookie('date of birth', 'february 4, 1996')

// читать значение cookie, напишем функцию чтения
const getCookie = (name) => {
    for (const entryStr of document.cookie.split('; ')) {
        const [entryName, entryValue] = entryStr.split('=')

        if (decodeURIComponent(entryName) === name) {
            return entryValue
        }
    }
}

// проверим нашу функцию
console.log('username:', getCookie('username'))
console.log('date of birth:', getCookie('date of birth'))

// удаление записи из cookie
/*
в devtools это сделать легко, нажав правую кнопку мыши.
на уровне кода это делается по другому.
у каждой записи есть срок истечения, при ручном удалении или
добавлении записи мы можем добавлять дополнительные параметры.
переписываем setCookie и добавляем утилитарную функцию deleteCookie
*/
const deleteCookie = (name) => {
    // из-за отрицательной длительности сессии записи она удаляется
    setCookie(name, '', { 'max-age': -1 })
}

deleteCookie('username')

/*
у этого хранилища данных есть существенные ограничения:
1. Общее кол-во записей на один домен может быть не более
20 штук;
2. объем данных в одной записи cookie не должен превышать
более 4 килобайт.
фронтендерам без острой необходимости не стоит лезть в cookie.
coolie предназначен для данных, которые принудительно туда
устанавливаются самим сервером. например сервер сохраняет токен,
идентификатор сессии.
*/
// sessionStorage и localStorage
/*
как и cookie в них:
1. данные в этих двух хранилищах сохраняются после перезагрузки страницы;
2. данные в этих хранилищах привязаны к конкретному домену.

отличаются от cookie они:
cookie могут управлять сервером а localStorage и sessionStorage нет.
cookie нужны для клиент-серверного взаимодействия, а localStorage и session
это то, чем фронтендер может управлять единолично. в двух хранилищах можно
хранить куда больший объем данных, как минимум 5 мегабайт. у них есть удобные
методы чтения добавления удаления данных, в отличие от cookie.
в двух хранилищах нет срока давности, в отличие от cookie.
*/
// методы управления localStorage sessionStorage
/* 
если мы выведем в консоль эти два хранилища, то они будут одинаковыми
в терминале, на самом деле и методы у них одинаковые.

устанавливать значения можно только в строке. конечно можно указать число,
но это будет некорректно и ide любезно подскажет, что так нельзя.
*/
console.log(sessionStorage)
console.log(localStorage)

// устанавливаем элемент в хранилище
sessionStorage.setItem('username', 'gleb')

// автоматически приведется число к строке и так неправильно
sessionStorage.setItem('age', 67)

// чтобы установить более серьезные данные, используем stringify
sessionStorage.setItem(
    'user',
    JSON.stringify({
        name: 'liza', 
        age: 21,
        isDeveloper: false,
    })
)

// получить элемент из хранилища
console.log('username:', sessionStorage.getItem('username'))

// убеждаемся что наш age это строка
console.log('age:', typeof sessionStorage.getItem('age'))

// удалить элемент из хранилища
sessionStorage.removeItem('username')

/*
sessionStorage отличается от localStorage:
1. время хранения:
localStorage: работает как долгосрочный жесткий диск вашего сайта в 
браузере.
sessionStorage: работает как оперативная память для конкретной сессии;
2. область видимости:
localStorage:  Если открыть сайт в пяти разных вкладках, все они будут 
делить между собой одно и то же пространство localStorage.
sessionStorage: Каждая вкладка создает абсолютно независимый контекст. 
Даже если вы откроете одну и ту же страницу в двух вкладках, у каждой 
из них будет свой собственный sessionStorage, и они никак не 
смогут прочитать данные друг друга.
*/